# // 몫
# % 나머지
# n**m n의m승 
# _ 마지막에 인쇄된 표현식은 변수 _에 대입됨
# round 반올림
# """...""" 줄넘김 문자는 자동으로 문자열 포함, 방지는 \
# 문자열은 + 연산자로 이어붙이고 * 연산자로 반복
# 문자열은 인덱스가 있음 word = python, word[0] >>> p, word[-1] => n, word[2:5] >>> tho
# 문자열은 불변 word[0] = j 에러
# len() 문자열의 길이 반환
# 리스트 list = [1, 4, 9, 16, 25], list[0] >>> 1, list[-1] >>> 25, list[-3:] >>> 9, 16, 25
# 리스트는 가변 list[0] = 4 가능
# list.append(216) 끝에 새 항목 추가
# 리스트 길이 변경가능, 항목 삭제 가능 list[:] = [] 
# 리스트 중첩 가능, a = ['a','b','c'], n = [1, 2, 3], x = [a, n] >>> [['a','b','c'],[1, 2, 3]], x[0] >>> ['a','b','c'], x[0][1] >>> 'b'
# 다중 대입 a, b = 0, 1 == a = 0, b = 1